Revit 2027 API
SchemaBuilder.SetReadAccessLevel Method
 Sets top level read access (for entities)
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SchemaBuilder SetReadAccessLevel(
	AccessLevel readAccessLevel
)
Public Function SetReadAccessLevel (
	readAccessLevel As AccessLevel
) As SchemaBuilder
public:
SchemaBuilder^ SetReadAccessLevel(
	AccessLevel readAccessLevel
)
member SetReadAccessLevel :
        readAccessLevel : AccessLevel -> SchemaBuilder
Parameters
readAccessLevel AccessLevel
 Read access level value to be set
Return Value
SchemaBuilder
 The SchemaBuilder object may be used to add more settings.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The SchemaBuilder has already finished building the Schema.
See Also
Reference
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace